___
### **<span style="color:red">Null Coalescing</span>**
___

___
#### **<span style="color:aqua">HERE ARE SOME MORE EXAMPLES USING DB FIDDLE...<span>**
___

**<span style="color:aqua">SCHEMA FROM DB FIDDLE (PostgreSQL v12)</span>**

    CREATE TABLE "Student" (
      id serial PRIMARY KEY,
      name varchar(255),
      lastName varchar(255),
      age int
    );
    
    INSERT INTO "Student" (name, lastName, age)
    VALUES ('STUDENT 1', Null, Null);
    
    INSERT INTO "Student" (name, lastName, age)
    VALUES ('STUDENT 2', Null, 25);
    
    INSERT INTO "Student" (name, lastName, age)
    VALUES (Null, 'LAST NAME 3', 20);
    
    INSERT INTO "Student" (name, lastName, age)
    VALUES (Null, Null, 34);
    
    INSERT INTO "Student" (name, lastName, age)
    VALUES ('STUDENT 5', Null, 58);
    

> [View on DB Fiddle](https://www.db-fiddle.com/f/2h5f24hRseg8YDUP9btj3g/2)

**Query #1**

    SELECT * FROM "Student";

| id  | name      | lastname    | age |
| --- | --------- | ----------- | --- |
| 1   | STUDENT 1 |             |     |
| 2   | STUDENT 2 |             | 25  |
| 3   |           | LAST NAME 3 | 20  |
| 4   |           |             | 34  |
| 5   | STUDENT 5 |             | 58  |

**Query #2**

    SELECT name, lastName FROM "Student";

| name      | lastname    |
| --------- | ----------- |
| STUDENT 1 |             |
| STUDENT 2 |             |
|           | LAST NAME 3 |
|           |             |
| STUDENT 5 |             |

**Query #3**

    SELECT coalesce(name, 'no name available'), lastName FROM "Student";

| coalesce          | lastname    |
| ----------------- | ----------- |
| STUDENT 1         |             |
| STUDENT 2         |             |
| no name available | LAST NAME 3 |
| no name available |             |
| STUDENT 5         |             |

**Query #4**

    SELECT sum(age) FROM "Student";

| sum |
| --- |
| 137 |

**Query #5**

    SELECT age FROM "Student";

| age |
| --- |
|     |
| 25  |
| 20  |
| 34  |
| 58  |

**Query #6**

    SELECT sum(coalesce(age, 20)) FROM "Student";

| sum |
| --- |
| 157 |

**Query #7**

    SELECT sum(coalesce(age, 200)) FROM "Student";

| sum |
| --- |
| 337 |

___
___
#### <span style="color:lightgreen">Exercise Null Value Coalescing</span>
___
___

**<span style="color:lightgreen">EXERCISE 1:</span>**

DB: https://www.db-fiddle.com/f/PnGNcaPYfGoEDvfexzEUA/0

Question: 

Assuming a students minimum age for the class is 15, what is the average age of a student?

**Query #1**

    SELECT avg(coalesce(age, 15)) FROM "Student";

| avg                 |
| ------------------- |
| 30.4000000000000000 |

___

**<span style="color:lightgreen">EXERCISE 2:</span>**

DB: https://www.db-fiddle.com/f/PnGNcaPYfGoEDvfexzEUA/0

Question: 

Replace all empty first or last names with a default?

**Query #1**

    SELECT coalesce(name, 'name'), coalesce(lastName, 'last name') FROM "Student";

| coalesce  | coalesce    |
| --------- | ----------- |
| STUDENT 1 | last name   |
| STUDENT 2 | last name   |
| name      | LAST NAME 3 |
| name      | last name   |
| STUDENT 5 | last name   |

\
**Query #2**

    SELECT id, coalesce(name, 'fallback'), coalesce(lastName, 'lastName'), age FROM "Student";

| id  | coalesce  | coalesce    | age |
| --- | --------- | ----------- | --- |
| 1   | STUDENT 1 | lastName    |     |
| 2   | STUDENT 2 | lastName    | 25  |
| 3   | fallback  | LAST NAME 3 | 20  |
| 4   | fallback  | lastName    | 34  |
| 5   | STUDENT 5 | lastName    | 58  |
___